refactor: update architecture diagram in readme
